export const slides = [
  {
    id: 1,
    image: "/assets/bags.png",
    title: "سوبر تخفيضات ضخمة على كل ما تحتاجه للسفر",
    subtitle: "لا تفوت الفرصة الذهبية التي لا تُعوض!",
    offer: "خصم 50%",
    subtext:
      "استعد لرحلتك الآن مع أفضل العروض على الحقائب، الأدوات، والمستلزمات الأساسية.",
    button: "تسوق الآن",
  },
  {
    id: 2,
    image: "/assets/sofa.png",
    title: "عروض الصيف المذهلة على مستلزمات الراحة والرفاهية",
    subtitle: "اغتنم الفرصة قبل نفاد الكمية!",
    offer: "خصم 30%",
    subtext:
      "دلّل نفسك بمذاق القهوة الأصيلة والأجهزة المنزلية العصرية بأسعار لا تصدق.",
    button: "ابدأ التسوق",
  },
  {
    id: 3,
    image: "/assets/phone.png",
    title: "اكتشف أحدث تشكيلاتنا بخصومات موسمية",
    subtitle: "وفر أكثر، وامتلك الأفضل!",
    offer: "خصم 30%",
    subtext:
      "استعد لاستقبال الصيف بأناقة مع مجموعتنا الجديدة من المنتجات المختارة بعناية.",
    button: "اكتشف الآن",
  },
];
